In [12]:
#Data Cleaning (Handling Missing Values)
import pandas as pd
df_miss = pd.DataFrame({
    'A': [1, 2, None, 4],   
    'B': [None, 2, 3, 4],
    'C': [1, None, None, 4]
})
df_miss

     A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  NaN
2  NaN  3.0  NaN
3  4.0  4.0  4.0

In [4]:
df_miss.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       3 non-null      float64
 2   C       2 non-null      float64
dtypes: float64(3)
memory usage: 228.0 bytes

In [6]:
# df_miss.isnull()
print("Counting Missing Values in Each Column:")
df_miss.isnull().sum()

Counting Missing Values in Each Column:

A    1
B    1
C    2
dtype: int64

In [ ]:
df_miss.dropna() #Drop rows with missing values

     A    B    C
3  4.0  4.0  4.0

In [9]:
df_miss.dropna(axis=1) #Drop columns with missing values

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [11]:
# Handling Missing Values
#Fill miss values with vaues
df_miss.fillna(99)  #Fill missing values with 99

      A     B     C
0   1.0  99.0   1.0
1   2.0   2.0  99.0
2  99.0   3.0  99.0
3   4.0   4.0   4.0

In [13]:
A_mean = df_miss['A'].mean()
df_miss['A'].fillna(A_mean, inplace=True)  #Fill missing values in column 'A' with mean
df_miss

C:\Users\rashm\AppData\Local\Temp\ipykernel_13456\2037183645.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_miss['A'].fillna(A_mean, inplace=True)  #Fill missing values in column 'A' with mean

          A    B    C
0  1.000000  NaN  1.0
1  2.000000  2.0  NaN
2  2.333333  3.0  NaN
3  4.000000  4.0  4.0

In [8]:
df_miss

     A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  NaN
2  NaN  3.0  NaN
3  4.0  4.0  4.0

In [16]:
#Replace NanN in Clolumn B with median
B_median = df_miss['B'].median()
df_miss['B'].fillna(B_median, inplace=True)
df_miss

C:\Users\rashm\AppData\Local\Temp\ipykernel_13456\1387148189.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_miss['B'].fillna(B_median, inplace=True)

          A    B    C
0  1.000000  3.0  1.0
1  2.000000  2.0  NaN
2  2.333333  3.0  NaN
3  4.000000  4.0  4.0

In [17]:
df_miss['C'].mode()[0]

np.float64(1.0)

In [21]:
df_miss.ffill()  #Forward Fill

          A    B    C
0  1.000000  3.0  1.0
1  2.000000  2.0  1.0
2  2.333333  3.0  1.0
3  4.000000  4.0  4.0

In [ ]:
df_miss.bfill(inplace=True)  #Backward Fill Nan with last known value

          A    B    C
0  1.000000  3.0  1.0
1  2.000000  2.0  1.0
2  2.333333  3.0  1.0
3  4.000000  4.0  4.0

In [24]:
df_miss.fillna(method='bfill')  # Backard Fill

C:\Users\rashm\AppData\Local\Temp\ipykernel_13456\374440789.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_miss.fillna(method='bfill')  # Backard Fill

          A    B    C
0  1.000000  3.0  1.0
1  2.000000  2.0  1.0
2  2.333333  3.0  1.0
3  4.000000  4.0  4.0

In [25]:
df_dups = pd.DataFrame({
    'A': [1, 2, 2, 4, 4, 4],
    'B': ['a', 'b', 'b', 'c', 'c', 'c']
})
df_dups

   A  B
0  1  a
1  2  b
2  2  b
3  4  c
4  4  c
5  4  c

In [29]:
df_dups.duplicated().sum()

np.int64(3)

In [31]:
df_dups.drop_duplicates()

   A  B
0  1  a
1  2  b
3  4  c

In [2]:
import pandas as pd
df_dups =pd.DataFrame({
    'A': [1, 2, 2, 4, 4, 4],
    'B': ['a', 'b', 'b', 'c', 'c', 'c'],
    'C': [10, 20, 20, 40, 40, 40]
})
df_dups

   A  B   C
0  1  a  10
1  2  b  20
2  2  b  20
3  4  c  40
4  4  c  40
5  4  c  40

In [4]:
#check if there are any duplicate rows
#df_dups.duplicated() #print a boolean series indicating duplicate rows
df_dups[['A','C']].duplicated()

0    False
1    False
2     True
3    False
4     True
5     True
dtype: bool

In [6]:
df_dups.drop_duplicates()

   A  B   C
0  1  a  10
1  2  b  20
3  4  c  40

In [7]:
#check the size/number of columns of DataFrame after removing  duplicate
print(f"Initial number of rows: {len(df_dups)} After removing duplicates: {len(df_dups.drop_duplicates())}")

Initial number of rows: 6 After removing duplicates: 3

In [ ]:
df_dups.columns #get column nname of dataframe

Index(['A', 'B', 'C'], dtype='object')

In [9]:
#Detecting and Replacing the Outliers with median value of the column using IQR method
df_out =pd.DataFrame({
    'Values': [1, 2, 2, 4, 400, 4],
   
})
df_out

   Values
0       1
1       2
2       2
3       4
4     400
5       4

In [10]:
def df_replace_outliers_iqr(df, column):
    Q1 = df[column].quantile(0.25)
    Q3 = df[column].quantile(0.75)
    IQR = Q3 - Q1
    lower_bound = Q1 - 1.5 * IQR
    upper_bound = Q3 + 1.5 * IQR
    median_value = df[column].median()
    print(f"Lower Bound: {lower_bound}, Upper Bound: {upper_bound}, Median: {median_value}")
    #The two lines below delete the rows with outlier
    #condition = (df[column] < lower_bound) | (df[column] > upper_bound)
    #df = df[~condition]

    condition = (df[column] < lower_bound) | (df[column] > upper_bound)
    df.loc[condition, column] = median_value
    return df

In [11]:
print(f"Size of Original DataFrame: {len(df_out)}")
df_out_cleaned = df_replace_outliers_iqr(df_out, 'Values')
print(f"Size of Cleaned DataFrame: {len(df_out_cleaned)}")
df_out_cleaned

Size of Original DataFrame: 6
Lower Bound: -1.0, Upper Bound: 7.0, Median: 3.0
Size of Cleaned DataFrame: 6

   Values
0       1
1       2
2       2
3       4
4       3
5       4

In [12]:
#Data Aggregation and Grouping
#Grouping and aggregation are essential for summarizing data,calculating statistics by category etc.
#Key Methods:
#groupby(),agg(),transform(),pivot_table(),crosstab()

#sample sales DataFrame for Grouping and Aggregation
sales_data = {
    'Date': pd.date_range(start='2023-01-01', periods=10, freq='D'),
    'Salesperson': ['Alice', 'Bob', 'Alice', 'David', 'Bob', 'Eva', 'David', 'Alice', 'Eva', 'Bob'],
    'Region': ['North', 'South', 'East', 'West', 'North', 'East', 'South', 'West', 'North', 'East'],
    'Product': ['A', 'B', 'A', 'C', 'B', 'A', 'C', 'A', 'B', 'C'],
    'Amount': [5000, 7000, 6000, 8000, 7500, 6500, 7200, 5800, 6900, 7100],
    'Quantity': [50, 70, 60, 80, 75, 65, 72, 58, 69, 71]
}

sales_df = pd.DataFrame(sales_data)
sales_df

        Date Salesperson Region Product  Amount  Quantity
0 2023-01-01       Alice  North       A    5000        50
1 2023-01-02         Bob  South       B    7000        70
2 2023-01-03       Alice   East       A    6000        60
3 2023-01-04       David   West       C    8000        80
4 2023-01-05         Bob  North       B    7500        75
5 2023-01-06         Eva   East       A    6500        65
6 2023-01-07       David  South       C    7200        72
7 2023-01-08       Alice   West       A    5800        58
8 2023-01-09         Eva  North       B    6900        69
9 2023-01-10         Bob   East       C    7100        71

In [18]:
salary =[2000,3000,4000,5000]
avg_salary = sum(salary)/len(salary)
avg_salary

3500.0

In [2]:
!pip3 install pandas

Requirement already satisfied: pandas in c:\users\rashm\appdata\local\programs\python\python313\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\rashm\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\rashm\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\rashm\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\rashm\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\rashm\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Requirement already satisfied: pandas in c:\users\rashm\appdata\local\programs\python\python313\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\rashm\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\rashm\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\rashm\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\rashm\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\rashm\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)